[
  "Son: \"Mom, can I get $20?\" \nMom: \"Does it look like I’m made of money?\"\nSon: \"Well, isn’t that what M.O.M stands for?\"",

  "What did the baby corn say to the mama corn? \"Where's Pop Corn?\"",

  "Daughter: \"Mom, I need my personal space!\"\nMom: \"You came out of my personal space.\"",

  "Mother: (n.) One person who does the work of 20 for free.",

  "Don’t wake up mom! There are at least seven species that eat their young. Your mom may be one of them.",

  "I asked a police recruit during an exam, \"What would you do if you had to arrest your own mother?\" he said, \"Call for backup.\"",

  "Why is a computer so smart? Because it listens to its motherboard.",

  "Why did the cookie cry? Because his mother was a wafer so long!",

  "What are the three quickest ways to spread a rumor? The internet, telephone, and telling your mom",

  "What do you call a small mom? Minimum.",

  "\"It just occurred to me that the majority of my diet is made up of the foods that my kid didn’t finish.\" — Carrie Underwood",

  "A mother said to her son, “Look at that kid over there; he’s not misbehaving.”\nThe son replied, “Maybe he has good parents then!”",

  "“How do I explain [my mom]? She is as respected as Mother Teresa, as powerful as Stalin, and as beautiful as Margaret Thatcher.” — Leslie Knope, Parks & Recreation (2009-2015)",

  "What did the Mama tomato say to the baby tomato? “Ketchup!”",

  "Why don’t mothers wear watches? There’s a clock on the stove.",

  "Why did the baby strawberry cry? Because his mom was in a jam!",

  "What did the mama say to the foal? “It’s pasture your bedtime.”",

  "What did Mommy spider say to baby spider? “You spend too much time on the web.”",

  "What did the mother broom say to the baby broom? “It’s time to go to sweep!”",
  "Science teacher: “When is the boiling point reached?”\nStudent: “When my mother sees my report card!”",

  "“Humpty, If I’ve told you once, I’ve told you a hundred times not to sit on that wall. But would you listen to me? No!” — Humpty Dumpty’s mother",
  
  "“I’ve got a bill here for a broken chair from the Bear family. Do you know anything about this, Goldie?” — Goldilocks’ mother",

  "“Mike, can’t you paint on walls like other children? Do you have any idea how hard it is to get that stuff off the ceiling?” — Michelangelo’s mother",

  "Daughter: “Mom, what’s it like to have the greatest daughter in the world?”\nMother: “I don’t know dear, ask your grandmother.”",

  "“If at first you don’t succeed… try doing it the way Mom told you to in the beginning.” — Unknown",

  "“If you’ve never said, ‘You need to back up a little so I can wipe myself,’ do you even have kids?” — The Mother Octopus",

  "“I always remind my kids: Having a weird mom builds character.” — Wellnessmama",

  "“I’m just a mom, standing in front of my husband, trying to say something that I can no longer remember because our kids interrupted us 175 times.” — Mommy Owl",

  "“I love all my children equally. Except for the one that sleeps… I love that one more.” — Unknown",

  "What did the panda give his mommy? A bear hug.",

  "What makes more noise than a child jumping on mommy’s bed? Two children jumping on mommy’s bed!",

  "Why was it so hard for the pirate to call his mom? Because she left the phone off the hook."
]
